v2.3.0: Fixes & Improvements
